embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/usb_examples/usb_device_composite_cdc_audio_unified/bm/audio_unified.c
    if (g_deviceAudioComposite->audioUnified.speakerIntervalCount != AUDIO_CALCULATE_Ff_INTERVAL)
    {
        g_deviceAudioComposite->audioUnified.speakerIntervalCount++;
        return;
    }
    g_deviceAudioComposite->audioUnified.speakerIntervalCount = 1;

    g_deviceAudioComposite->audioUnified.timesFeedbackCalculate++;
    if (g_deviceAudioComposite->audioUnified.timesFeedbackCalculate == 2)
    {
        originFeedbackValue = ((g_deviceAudioComposite->audioUnified.audioSendCount -
                                g_deviceAudioComposite->audioUnified.lastAudioSendCount)
                               << 4) /
                              (AUDIO_FORMAT_CHANNELS * AUDIO_FORMAT_SIZE);
        feedbackValue = originFeedbackValue;
        AUDIO_UPDATE_FEEDBACK_DATA(audioFeedBackBuffer, originFeedbackValue);
        audioSpeakerUsedSpace = USB_AudioSpeakerBufferSpaceUsed();
        audioSpeakerLastUsedSpace = audioSpeakerUsedSpace;
    }
    else if (g_deviceAudioComposite->audioUnified.timesFeedbackCalculate > 2)
    {
        audioSpeakerUsedSpace = USB_AudioSpeakerBufferSpaceUsed();
        audioSpeakerUsedDiff += (audioSpeakerUsedSpace - audioSpeakerLastUsedSpace);
        audioSpeakerLastUsedSpace = audioSpeakerUsedSpace;

        if ((audioSpeakerUsedDiff > -AUDIO_SAMPLING_RATE_KHZ) && (audioSpeakerUsedDiff < AUDIO_SAMPLING_RATE_KHZ))
        {
            audioSpeakerDiffThres = 4 * AUDIO_SAMPLING_RATE_KHZ;
        }
        if (audioSpeakerUsedDiff <= -audioSpeakerDiffThres)
        {
            audioSpeakerDiffThres += 4 * AUDIO_SAMPLING_RATE_KHZ;
            feedbackValue += (AUDIO_SAMPLING_RATE_KHZ / AUDIO_SAMPLING_RATE_16KHZ) * (AUDIO_ADJUST_MIN_STEP);
        }
        if (audioSpeakerUsedDiff >= audioSpeakerDiffThres)
        {
            audioSpeakerDiffThres += 4 * AUDIO_SAMPLING_RATE_KHZ;
            feedbackValue -= (AUDIO_SAMPLING_RATE_KHZ / AUDIO_SAMPLING_RATE_16KHZ) * (AUDIO_ADJUST_MIN_STEP);
        }
        AUDIO_UPDATE_FEEDBACK_DATA(audioFeedBackBuffer, feedbackValue);
    }
    else
    {
    }
    g_deviceAudioComposite->audioUnified.lastAudioSendCount = g_deviceAudioComposite->audioUnified.audioSendCount;
}
#endif
/*!
 * @brief device Audio callback function.
 *
 * This function handle the Audio class specified event.
 * @param handle          The USB class  handle.
 * @param event           The USB device event type.
 * @param param           The parameter of the class specific event.
 * @return kStatus_USB_Success or error.
 */
usb_status_t USB_DeviceAudioCompositeCallback(class_handle_t handle, uint32_t event, void *param)
{
    usb_status_t error = kStatus_USB_Error;
    usb_device_endpoint_callback_message_struct_t *ep_cb_param;
    ep_cb_param = (usb_device_endpoint_callback_message_struct_t *)param;

    switch (event)
    {
        case kUSB_DeviceAudioEventStreamSendResponse:
            if ((g_deviceAudioComposite->audioUnified.attach) && (ep_cb_param->length != (USB_UNINITIALIZED_VAL_32)))
            {
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
                if (0)
                {
                }
#else
                if (ep_cb_param->length == ((USB_SPEED_HIGH == g_composite.speed) ? HS_ISO_FEEDBACK_ENDP_PACKET_SIZE :
                                                                                    FS_ISO_FEEDBACK_ENDP_PACKET_SIZE))
                {
                    error = USB_DeviceAudioSend(
                        g_deviceAudioComposite->audioUnified.audioSpeakerHandle, USB_AUDIO_SPEAKER_FEEDBACK_ENDPOINT,
                        audioFeedBackBuffer, (USB_SPEED_HIGH == g_composite.speed) ? HS_ISO_FEEDBACK_ENDP_PACKET_SIZE :
                                                                                     FS_ISO_FEEDBACK_ENDP_PACKET_SIZE);
                }
#endif
                else
                {
                    USB_PrepareData();
                    error =
                        USB_DeviceAudioSend(g_deviceAudioComposite->audioUnified.audioRecorderHandle,
                                            USB_AUDIO_RECORDER_STREAM_ENDPOINT, s_wavBuff, FS_ISO_IN_ENDP_PACKET_SIZE);
                }
            }
            break;
        case kUSB_DeviceAudioEventStreamRecvResponse:
            if ((g_deviceAudioComposite->audioUnified.attach) && (ep_cb_param->length != (USB_UNINITIALIZED_VAL_32)))
            {
                if (g_deviceAudioComposite->audioUnified.startPlay == 0)
                {
                    g_deviceAudioComposite->audioUnified.startPlay = 1;
                }
                if ((g_deviceAudioComposite->audioUnified.tdReadNumberPlay >=
                     AUDIO_SPEAKER_DATA_WHOLE_BUFFER_LENGTH * FS_ISO_OUT_ENDP_PACKET_SIZE / 2) &&
                    (g_deviceAudioComposite->audioUnified.startPlayHalfFull == 0))
                {
                    g_deviceAudioComposite->audioUnified.startPlayHalfFull = 1;
                }
                USB_AudioSpeakerPutBuffer(audioPlayPacket, ep_cb_param->length);
                g_deviceAudioComposite->audioUnified.usbRecvCount += ep_cb_param->length;
                g_deviceAudioComposite->audioUnified.usbRecvTimes++;
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
                error = USB_DeviceAudioRecv(handle, USB_AUDIO_SPEAKER_STREAM_ENDPOINT, &audioPlayPacket[0],
                                            (FS_ISO_OUT_ENDP_PACKET_SIZE));
#else
                USB_AUDIO_ENTER_CRITICAL();
                USB_AudioFeedbackDataUpdate();
                USB_AUDIO_EXIT_CRITICAL();
                error = USB_DeviceAudioRecv(handle, USB_AUDIO_SPEAKER_STREAM_ENDPOINT, &audioPlayPacket[0],
                                            (FS_ISO_OUT_ENDP_PACKET_SIZE + AUDIO_FORMAT_CHANNELS * AUDIO_FORMAT_SIZE));
#endif
            }
            break;

        default:
            if (param && (event > 0xFF))
            {
                error = USB_DeviceAudioRequest(handle, event, param);
            }
            break;
    }

    return error;
}

/* The USB_DeviceAudioSpeakerStatusReset() function resets the audio speaker status to the initialized status */
void USB_DeviceAudioSpeakerStatusReset(void)
{
    g_deviceAudioComposite->audioUnified.startPlay = 0;
    g_deviceAudioComposite->audioUnified.startPlayHalfFull = 0;
    g_deviceAudioComposite->audioUnified.tdReadNumberPlay = 0;
    g_deviceAudioComposite->audioUnified.tdWriteNumberPlay = 0;
    g_deviceAudioComposite->audioUnified.audioSendCount = 0;
    g_deviceAudioComposite->audioUnified.usbRecvCount = 0;
    g_deviceAudioComposite->audioUnified.lastAudioSendCount = 0;
    g_deviceAudioComposite->audioUnified.audioSendTimes = 0;
    g_deviceAudioComposite->audioUnified.usbRecvTimes = 0;
    g_deviceAudioComposite->audioUnified.speakerIntervalCount = 0;
    g_deviceAudioComposite->audioUnified.speakerReservedSpace = 0;
    g_deviceAudioComposite->audioUnified.timesFeedbackCalculate = 0;
    g_deviceAudioComposite->audioUnified.speakerDetachOrNoInput = 0;
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
    g_deviceAudioComposite->audioUnified.audioPllTicksPrev = 0;
    g_deviceAudioComposite->audioUnified.audioPllTicksDiff = 0;
    g_deviceAudioComposite->audioUnified.audioPllTicksEma = AUDIO_PLL_USB1_SOF_INTERVAL_COUNT;
    g_deviceAudioComposite->audioUnified.audioPllTickEmaFrac = 0;
    g_deviceAudioComposite->audioUnified.audioPllStep = AUDIO_PLL_FRACTIONAL_CHANGE_STEP;
#endif
}

/*!
 * @brief Audio set configuration function.
 *
 * This function sets configuration for msc class.
 *
 * @param handle The Audio class handle.
 * @param configure The Audio class configure index.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceAudioCompositeSetConfigure(class_handle_t handle, uint8_t configure)
{
    if (USB_COMPOSITE_CONFIGURE_INDEX == configure)
    {
        g_deviceAudioComposite->audioUnified.attach = 1U;
    }
    return kStatus_USB_Success;
}

usb_status_t USB_DeviceAudioRecorderSetInterface(class_handle_t handle, uint8_t interface, uint8_t alternateSetting)
{
    if (alternateSetting == 1U)
    {
        USB_PrepareData();
        USB_DeviceAudioSend(g_deviceAudioComposite->audioUnified.audioRecorderHandle,
                            USB_AUDIO_RECORDER_STREAM_ENDPOINT, s_wavBuff, FS_ISO_IN_ENDP_PACKET_SIZE);
    }
    return kStatus_USB_Error;
}

usb_status_t USB_DeviceAudioSpeakerSetInterface(class_handle_t handle, uint8_t interface, uint8_t alternateSetting)
{
    if (alternateSetting == 1U)
    {
        USB_DeviceAudioSpeakerStatusReset();
        USB_DeviceAudioRecv(g_deviceAudioComposite->audioUnified.audioSpeakerHandle, USB_AUDIO_SPEAKER_STREAM_ENDPOINT,
                            &audioPlayDataBuff[0], FS_ISO_OUT_ENDP_PACKET_SIZE);
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
#else
        USB_DeviceAudioSend(g_deviceAudioComposite->audioUnified.audioSpeakerHandle,
                            USB_AUDIO_SPEAKER_FEEDBACK_ENDPOINT, audioFeedBackBuffer,
                            (USB_SPEED_HIGH == g_composite.speed) ? HS_ISO_FEEDBACK_ENDP_PACKET_SIZE :
                                                                    FS_ISO_FEEDBACK_ENDP_PACKET_SIZE);
#endif
    }
    return kStatus_USB_Error;
}
/*!
 * @brief Audio init function.
 *
 * This function initializes the device with the composite device class information.
 *
 * @param device_composite          The pointer to the composite device structure.
 * @return kStatus_USB_Success .
 */
usb_status_t USB_DeviceAudioCompositeInit(usb_device_composite_struct_t *device_composite)
{
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
    SCTIMER_CaptureInit();
#else
    AUDIO_UPDATE_FEEDBACK_DATA(audioFeedBackBuffer, AUDIO_SAMPLING_RATE_TO_10_14);
#endif
    g_deviceAudioComposite = device_composite;
    g_deviceAudioComposite->audioUnified.copyProtect = 0x01U;
    g_deviceAudioComposite->audioUnified.curMute = 0x00U;
    g_deviceAudioComposite->audioUnified.curVolume[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.curVolume[1] = 0x1fU;
    g_deviceAudioComposite->audioUnified.minVolume[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.minVolume[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.maxVolume[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.maxVolume[1] = 0X43U;
    g_deviceAudioComposite->audioUnified.resVolume[0] = 0x01U;
    g_deviceAudioComposite->audioUnified.resVolume[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.curBass = 0x00U;
    g_deviceAudioComposite->audioUnified.curBass = 0x00U;
    g_deviceAudioComposite->audioUnified.minBass = 0x80U;
    g_deviceAudioComposite->audioUnified.maxBass = 0x7FU;
    g_deviceAudioComposite->audioUnified.resBass = 0x01U;
    g_deviceAudioComposite->audioUnified.curMid = 0x00U;
    g_deviceAudioComposite->audioUnified.minMid = 0x80U;
    g_deviceAudioComposite->audioUnified.maxMid = 0x7FU;
    g_deviceAudioComposite->audioUnified.resMid = 0x01U;
    g_deviceAudioComposite->audioUnified.curTreble = 0x01U;
    g_deviceAudioComposite->audioUnified.minTreble = 0x80U;
    g_deviceAudioComposite->audioUnified.maxTreble = 0x7FU;
    g_deviceAudioComposite->audioUnified.resTreble = 0x01U;
    g_deviceAudioComposite->audioUnified.curAutomaticGain = 0x01U;
    g_deviceAudioComposite->audioUnified.curDelay[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.curDelay[1] = 0x40U;
    g_deviceAudioComposite->audioUnified.minDelay[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.minDelay[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.maxDelay[0] = 0xFFU;
    g_deviceAudioComposite->audioUnified.maxDelay[1] = 0xFFU;
    g_deviceAudioComposite->audioUnified.resDelay[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.resDelay[1] = 0x01U;
    g_deviceAudioComposite->audioUnified.curLoudness = 0x01U;
    g_deviceAudioComposite->audioUnified.curSamplingFrequency[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.curSamplingFrequency[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.curSamplingFrequency[2] = 0x01U;
    g_deviceAudioComposite->audioUnified.minSamplingFrequency[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.minSamplingFrequency[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.minSamplingFrequency[2] = 0x01U;
    g_deviceAudioComposite->audioUnified.maxSamplingFrequency[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.maxSamplingFrequency[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.maxSamplingFrequency[2] = 0x01U;
    g_deviceAudioComposite->audioUnified.resSamplingFrequency[0] = 0x00U;
    g_deviceAudioComposite->audioUnified.resSamplingFrequency[1] = 0x00U;
    g_deviceAudioComposite->audioUnified.resSamplingFrequency[2] = 0x01U;
    g_deviceAudioComposite->audioUnified.tdReadNumberPlay = 0;
    g_deviceAudioComposite->audioUnified.tdWriteNumberPlay = 0;
    g_deviceAudioComposite->audioUnified.audioSendCount = 0;
    g_deviceAudioComposite->audioUnified.lastAudioSendCount = 0;
    g_deviceAudioComposite->audioUnified.usbRecvCount = 0;
    g_deviceAudioComposite->audioUnified.audioSendTimes = 0;
    g_deviceAudioComposite->audioUnified.usbRecvTimes = 0;
    g_deviceAudioComposite->audioUnified.startPlay = 0;
    g_deviceAudioComposite->audioUnified.startPlayHalfFull = 0;
    g_deviceAudioComposite->audioUnified.speakerIntervalCount = 0;
    g_deviceAudioComposite->audioUnified.speakerReservedSpace = 0;
    g_deviceAudioComposite->audioUnified.timesFeedbackCalculate = 0;
    g_deviceAudioComposite->audioUnified.speakerDetachOrNoInput = 0;
#if defined(USB_DEVICE_AUDIO_USE_SYNC_MODE) && (USB_DEVICE_AUDIO_USE_SYNC_MODE > 0U)
    g_deviceAudioComposite->audioUnified.audioPllTicksPrev = 0;
    g_deviceAudioComposite->audioUnified.audioPllTicksDiff = 0;
    g_deviceAudioComposite->audioUnified.audioPllTicksEma = AUDIO_PLL_USB1_SOF_INTERVAL_COUNT;
    g_deviceAudioComposite->audioUnified.audioPllTickEmaFrac = 0;
    g_deviceAudioComposite->audioUnified.audioPllStep = AUDIO_PLL_FRACTIONAL_CHANGE_STEP;
#endif
    return kStatus_USB_Success;
}

void USB_AudioSpeakerResetTask(void)
{
    if (g_deviceAudioComposite->audioUnified.speakerDetachOrNoInput)
    {
        USB_DeviceAudioSpeakerStatusReset();
    }
}
